#### Linear Regression in Multiple Variable

In [44]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt

In [45]:
# Improrting the Data from 'hirring.csv'
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [46]:
# renaming columns
df = df.rename(columns={"test_score(out of 10)":"test_score",	"interview_score(out of 10)":"interview_score","salary($)":"salary"})
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [47]:
# As we can can see the test_score and exprerience column has NaN value
# We will convert the experience column to have numerical values using the this package
# For NaN values in expericence we will assume it to be 'zero'
# We will fill the test_score value with the meadin test_score 
from word2number import w2n
df.experience = df.experience.fillna("zero") 
df.experience = df.experience.apply(w2n.word_to_num)
df.test_score = df.test_score.fillna(df.test_score.mean())

In [48]:
df

   experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

In [49]:
# Creating the Linear Model 
from sklearn import linear_model
model = linear_model.LinearRegression()

In [50]:
# Dependent Varaible - experience, test_Score, interview_score
# Independent Variable - salary
model.fit(df.drop('salary',axis='columns'),df.salary)

LinearRegression()

In [51]:
model.coef_

array([2827.63404314, 1912.93803053, 2196.9753141 ])

In [52]:
model.intercept_

17237.3303137272

In [57]:
print("Salary for 2 yr experience, 9 test score, 6 interview score : ",model.predict([[2,9,6]])[0])

Salary for 2 yr experience, 9 test score, 6 interview score :  53290.892559447646

In [58]:
print("Salary for 12 yr experience, 10 test score, 10 interview score : ",model.predict([[12,10,10]])[0])

Salary for 12 yr experience, 10 test score, 10 interview score :  92268.07227783566